//        ГОТОВАЯЕСТЬ - ГОТОВАЯНАДО
//        ГОТОВАЯНАДО – ГОТОВАЯЕСТЬ = РЕЗУЛЬТАТГОТОВОЙ, РЕЗУЛЬТАТГОТОВОЙ / ГОТОВАЯЕСТЬ = КОЭФФИЦИЕНТ
//        Нужно долить РЕЗУЛЬТАТГОТОВОЙ граммов готовой, для этого все компоненты умножить на КОЭФФИЦИЕНТ

//        ГОТОВАЯЕСТЬ - ГУСТАЯНАДО
//        (ГУСТАЯНАДО * 1,5) – ГОТОВАЯЕСТЬ = РЕЗУЛЬТАТГОТОВОЙ, РЕЗУЛЬТАТГОТОВОЙ / ГОТОВАЯЕСТЬ = КОЭФФИЦИЕНТ
//        Нужно долить РЕЗУЛЬТАТГОТОВОЙ граммов готовой (РЕЗУЛЬТАТГОТОВОЙ / 1,5 густой), для этого все компоненты умножить на КОЭФФИЦИЕНТ
//        (Если нужна краска именно в густом виде, просто не наливайте разбавитель)

//        ГУСТАЯЕСТЬ – ГОТОВАЯНАДО
//        (ГОТОВАЯНАДО / 1,5) – 100 = РЕЗУЛЬТАТГУСТОЙ, РЕЗУЛЬТАТГУСТОЙ / ГУСТАЯЕСТЬ = КОЭФФИЦИЕНТ
//        Нужно долить РЕЗУЛЬТАТГУСТОЙ густой краски (РЕЗУЛЬТАТГУСТОЙ * 1,5 готовой), для этого все компоненты умножить на КОЭФФИЦИЕНТ
//        В случае необходимости долить РЕЗУЛЬТАТГУСТОЙ / 1,5 разбавителя

//        ГУСТАЯЕСТЬ – ГУСТАЯНАДО
//        ГУСТАЯНАДО - ГУСТАЯЕСТЬ = РЕЗУЛЬТАТГУСТОЙ, РЕЗУЛЬТАТГУСТОЙ / ГУСТАЯЕСТЬ = КОЭФФИЦИЕНТ
//        Нужно долить РЕЗУЛЬТАТГУСТОЙ граммов густой, для этого все компоненты умножить на 2
//        В случае необходимости долить РЕЗУЛЬТАТГУСТОЙ / 1,5 разбавителя

public class CalculationMethod {

    String message;

    public void readyToReady() {
        
    }
}
